#include "IU.h"

IU::IU()
{
}

IU::~IU()
{

}

void IU::sing()
{
	for (char i = 0; i < 6; i++)
	{


		const string dancetypeIU[6] = {
		"좋은 날 ","내 손을 잡아" , "Blueming" ,
		"스물셋" , "하루 끝" , "Seceret(비밀)" };
		cout << "아이유 : " << dancetypeIU[i] << endl;
	}

	for (char i = 0; i < 2; i++)
	{


		const string RocktypeIU[2] = {
		"있잖아","내 손을 잡아(Rock)" };
		cout << "아이유 : " << RocktypeIU[i] << endl;
	}

	for (char i = 0; i < 6; i++)
	{


		const string balladtypeIU[6] = {
		"비밀의 화원 ","마침표" , "밤편지" ,
		"너의 의미(Feat.김창완)" , "마음" , "무릎" };
		cout << "아이유 : " << balladtypeIU[i] << endl;
	}
}

//void IU::CatchMyhand() // 내 손을 잡아 가사.
//{
	/*cout << "느낌이 오잖아 떨리고 있잖아\n\n"
		"언제까지 눈치만 볼 거니\n\n"
		"네 맘을 말해봐 딴청 피우지 말란 말이야\n\n"
		"네 맘 가는 그대로 지금 내 손을 잡아\n\n"
		"어서 내 손을 잡아\n\n"
		"우연히 고개를 돌릴 때 마다\n\n"
		"눈이 마주치는 건\n\n"
		"며칠밤 내내 꿈속에 나타나\n\n"
		"밤새 나를 괴롭히는 건\n\n"
		"그 많은 빈자리 중에서 하필\n\n"
		"내 옆자릴 고르는 건\n\n"
		"나도 모르게 어느새 실없는 웃음\n\n"
		"흘리고 있다는 건\n\n"
		"그럼 말 다했지 뭐 우리 얘기 좀 할까\n\n"
		"느낌이 오잖아 떨리고 있잖아\n\n"
		"언제까지 눈치만 볼 거니\n\n"
		"네 맘을 말해봐 딴청 피우지 말란 말이야\n\n"
		"네 맘 가는 그대로 지금 내 손을 잡아\n\n"
		"핸드폰 진동에 심장이 덜컥\n\n"
		"내려 앉는다는 건\n\n"
		"오 나도 모르게 어느새 짓궂은 네 말투\n\n"
		"자꾸 듣고 싶은걸\n\n"
		"어떡해\n\n"
		"(저기 멀리 걸어온다)\n\n"
		"(눈이 마주친다)\n\n"
		"언제까지 넌 모른척 할거니\n\n"
		"사랑이 온거야 너와 나 말이야\n\n"
		"네가 좋아 정말 못 견딜 만큼\n\n"
		"그거면 된거야 더는 생각하지 말란 말이야\n\n"
		"네 맘 가는 그대로\n\n"
		"느낌이 오잖아 떨리고 있잖아\n\n"
		"언제까지 눈치만 볼 거니\n\n"
		"네 맘을 말해봐 딴청 피우지 말란 말이야\n\n"
		"네 맘 가는 그대로 지금 내 손을 잡아\n\n"
		"그냥 내 손을 잡아 지금 내 손을 잡아\n\n"
		<< endl;*/
//}

//void IU::IUsinglist()
//{


//}
